{
  "layout.footer.copyright": "© {yearStart}-{yearEnd}, LLC «<link>{brand}</link>». All rights reserved",
  "homePage.hero.title": "Connecting digital worlds in all languages",
  "homePage.hero.conference": "I&L Conference {year}",
  "homePage.hero.location": "Moscow, Russia",
  "homePage.hero.price": "{price} ticket",
  "homePage.hero.register": "Register",
  "homePage.regionArticle.title": "Relevant for your region",
  "homePage.ruArticle.title": "How to adapt a web application for Russian users: localization nuances",
  "homePage.ruArticle.description": "Exploring preferences of Russian-speaking users, number and currency formats, interface translation and legal aspects (e.g., personal data law)",
  "homePage.byArticle.title": "Bilingual interface: how to accommodate Russian and Belarusian languages in one product",
  "homePage.byArticle.description": "Examining approaches to implementing a bilingual interface, translation standards and cultural differences. Special attention to Belarusian language content",
  "homePage.kzArticle.title": "Russian and Kazakh: effective localization for Kazakhstan",
  "homePage.kzArticle.description": "Analyzing scenarios when an application should be available in two languages simultaneously and features of Kazakh localization (including support for Latin and Cyrillic scripts, date formats)",
  "homePage.arArticle.title": "Localization for the Arabic-speaking world: RTL, formats and cultural codes",
  "homePage.arArticle.description": "From adapting the interface for right-to-left writing direction to choosing the right wording - key aspects of localization for Middle Eastern and North African countries",
  "homePage.enArticle.title": "Designing for a global audience: English as a universal language",
  "homePage.enArticle.description": "Why English is often used as the default language in international applications and how to write interface texts that will be clear, culturally neutral and convenient for subsequent localization",
  "homePage.rtlArticle.title": "Which icons should be flipped for RTL, and which should not?",
  "homePage.rtlArticle.description": "Not all icons require mirroring when switching to RTL languages. We figure out which icons depend on text direction and which are universal",
  "homePage.cssArticle.title": "Logical CSS properties in i18n-supported interfaces",
  "homePage.cssArticle.description": "Learn how logical CSS properties help create adaptive interfaces for different languages and writing directions - without complicating code or duplicating styles.",
  "homePage.articles.title": "Articles",
  "homePage.articles.description": "Total {count, plural, one {# article} other {# articles}}",
  "homePage.article.read": "Read"
}