{
  "layout.footer.copyright": "© {yearStart}-{yearEnd}, شركة ذات مسؤولية محدودة «<link>{brand}</link>». جميع الحقوق محفوظة",
  "articleRtlIcons.title": "أي أيقونات يجب قلبها لـ RTL، {br} وأيها لا يجب؟",
  "articleRtlIcons.intro": "عند تكييف الواجهات للغات من اليمين لليسار (RTL)، من المهم مراعاة ليس فقط التخطيط والنص ولكن أيضًا العناصر المرئية. العديد من الأيقونات تتطلب انعكاسًا، بينما يجب أن تبقى أخرى في شكلها الأصلي. العرض غير الصحيح يمكن أن يجعل الواجهة أقل بديهية ويُربك المستخدمين.",
  "articleRtlIcons.whyImportant.title": "لماذا من المهم قلب الأيقونات في RTL؟",
  "articleRtlIcons.whyImportant.text": "في واجهات RTL، لا يتغير اتجاه النص فقط ولكن أيضًا منطق التفاعل. يجب أن تعكس الأيقونات ذات الاتجاهية الواضحة هذا التغيير للحفاظ على تدفق الإدراك الطبيعي وتلبية توقعات المستخدم.",
  "articleRtlIcons.flipIcons.title": "الأيقونات التي يجب قلبها",
  "articleRtlIcons.flipIcons.text": "اقلب الأيقونات التي لها اتجاه واضح أو شكل غير متماثل (باستثناء الأمثلة التي سنناقشها لاحقًا في المقال). على سبيل المثال، أيقونة الملاحظات مع اتجاه نص واضح، أو أيقونة واجهة مستخدم نافذة التطبيق غير المتماثلة، أو أيقونة الرسالة. أمثلة على هذه الأيقونات:",
  "articleRtlIcons.dontFlipIcons.title": "الأيقونات التي لا يجب قلبها",
  "articleRtlIcons.dontFlipIcons.text": "لا تحتاج إلى قلب الأيقونات المتماثلة. الأيقونات التي هي شعارات أو تمثل علامة تجارية لا يجب أيضًا عكسها - يجب أن تظل قابلة للتعرف عليها. انتبه بشكل خاص للعناصر التي تتبع 'قاعدة اليد اليمنى' - إذا كانت الأيقونة مرتبطة بشكل بديهي بإجراء اليد اليمنى (مثل حمل شيء)، فيجب الحفاظ على اتجاهها بغض النظر عن اتجاه الكتابة. أمثلة على هذه الأيقونات:",
  "articleRtlIcons.conclusion.title": "الختام",
  "articleRtlIcons.conclusion.text1": "التعامل الصحيح مع الأيقونات في واجهات RTL هو جزء مهم من التوطين. هذه ليست مجرد تفاصيل تقنية، ولكنها طريقة لجعل الواجهة مريحة حقًا للمستخدمين بخصائص ثقافية مختلفة.",
  "articleRtlIcons.conclusion.text2": "<strong>توصية:</strong> طور معايير داخلية للمصممين والمطورين لضمان نهج متسق للعمل مع الأيقونات في جميع ترجمات المنتج."
}