{
  "layout.footer.copyright": "© {yearStart}-{yearEnd}, شركة ذات مسؤولية محدودة «<link>{brand}</link>». جميع الحقوق محفوظة",
  "articleCss.title": "استخدام خصائص CSS المنطقية للواجهات العالمية",
  "articleCss.intro": "في السنوات الأخيرة، أُولِيَ المزيد من الاهتمام لإنشاء منتجات ويب عالمية حقًا. هذا مهم بشكل خاص للمشاريع التي ينتشر جمهورها في جميع أنحاء العالم. عند تطوير واجهات بلغات مثل العربية، حيث يذهب النص واتجاه التخطيط من اليمين إلى اليسار (RTL)، من المهم أن يظل السلوك البصري للمكونات بديهيًا. إحدى الأدوات الرئيسية لذلك هي خصائص CSS المنطقية.",
  "articleCss.diff": "على عكس الخصائص الفيزيائية (مثل <code>margin-left</code>، <code>padding-right</code>، <code>border-top</code>)، تصف الخصائص المنطقية (<code>margin-inline-start</code>، <code>padding-block-end</code>، <code>border-inline</code>) السلوك بالنسبة لاتجاه الكتابة وليس اتجاه الشاشة الثابت. هذا مهم بشكل خاص في المشاريع حيث يمكن أن يكون المحتوى باللغة الإنجليزية أو العربية أو الصينية أو الروسية ولغات أخرى باتجاهات مختلفة.",
  "articleCss.whyImportant.title": "لماذا هذا مهم لواجهة i18n الأمامية",
  "articleCss.whyImportant.text": "يجعل استخدام الخصائص المنطقية الكود أكثر تكيفًا ويقلل من الحاجة إلى أنماط شرطية أو تكرار CSS. كما أنه يبسط الصيانة، خاصة في المنتجات متعددة اللغات حيث يجب أن يكون التبديل بين LTR و RTL سلسًا قدر الإمكان.",
  "articleCss.whyImportant.listText": "فيما يلي بعض فوائد الخصائص المنطقية في سياق العولمة:",
  "articleCss.whyImportant.listContent": "<ul><li>الشمولية: مجموعة واحدة من الأنماط تناسب جميع اتجاهات الكتابة.</li><li>صيانة أسهل: كود أقل، أخطاء أقل عند إجراء التغييرات.</li><li>المرونة: من السهل إضافة لغات جديدة دون تغيير بنية النمط.</li><li>الاتساق: نفس السلوك البصري لجميع المستخدمين، بغض النظر عن اللغة.</li><li>الأهمية: الامتثال لمعايير CSS الحديثة وأفضل ممارسات تصميم واجهة المستخدم.</li></ul>",
  "articleCss.conclusion.title": "الختام",
  "articleCss.conclusion.text": "يعد استخدام خصائص CSS المنطقية طريقة بسيطة وفعالة لجعل الواجهات قابلة للتكيف حقًا وموجهة عالميًا. يسمح هذا النهج بمراعاة الاختلافات اللغوية والثقافية دون تعقيد الكود أو تكرار الأنماط."
}