{
  "layout.footer.copyright": "© {yearStart}-{yearEnd}, شركة ذات مسؤولية محدودة «<link>{brand}</link>». جميع الحقوق محفوظة",
  "homePage.hero.title": "ربط العوالم الرقمية بجميع اللغات",
  "homePage.hero.conference": "مؤتمر I&L {year}",
  "homePage.hero.location": "موسكو، روسيا",
  "homePage.hero.price": "{price} تذكرة",
  "homePage.hero.register": "تسجيل",
  "homePage.regionArticle.title": "ذو صلة بمنطقتك",
  "homePage.ruArticle.title": "كيفية تكييف تطبيق الويب للمستخدمين الروس: دقائق الترجمة",
  "homePage.ruArticle.description": "استكشاف تفضيلات المستخدمين الناطقين بالروسية، تنسيقات الأرقام والعملات، ترجمة الواجهة والجوانب القانونية (مثل قانون البيانات الشخصية)",
  "homePage.byArticle.title": "واجهة ثنائية اللغة: كيفية استيعاب اللغتين الروسية والبيلاروسية في منتج واحد",
  "homePage.byArticle.description": "دراسة نهج تنفيذ واجهة ثنائية اللغة، معايير الترجمة والاختلافات الثقافية. اهتمام خاص بالمحتوى باللغة البيلاروسية",
  "homePage.kzArticle.title": "الروسية والكازاخستانية: توطين فعال لكازاخستان",
  "homePage.kzArticle.description": "تحليل السيناريوهات عندما يجب أن يكون التطبيق متاحًا بلغتين في وقت واحد وميزات الترجمة الكازاخستانية (بما في ذلك دعم النص اللاتيني والسيريلي، تنسيقات التاريخ)",
  "homePage.arArticle.title": "التوطين للعالم الناطق بالعربية: النمط من اليمين لليسار، الصيغ والرموز الثقافية",
  "homePage.arArticle.description": "من تكييف الواجهة لاتجاه الكتابة من اليمين لليسار إلى اختيار الصياغة الصحيحة - الجوانب الرئيسية للترجمة لدول الشرق الأوسط وشمال أفريقيا",
  "homePage.enArticle.title": "التصميم للجمهور العالمي: الإنجليزية كلغة عالمية",
  "homePage.enArticle.description": "لماذا تُستخدم الإنجليزية غالبًا كلغة افتراضية في التطبيقات الدولية وكيفية كتابة نصوص الواجهة التي ستكون واضحة ومحايدة ثقافيًا ومريحة للترجمة اللاحقة",
  "homePage.rtlArticle.title": "أي أيقونات يجب قلبها لـ RTL، وأيها لا يجب؟",
  "homePage.rtlArticle.description": "ليست كل الأيقونات تتطلب انعكاسًا عند التبديل إلى لغات RTL. نكتشف أي الأيقونات تعتمد على اتجاه النص وأيها عالمية",
  "homePage.cssArticle.title": "خصائص CSS المنطقية في الواجهات المدعومة بـ i18n",
  "homePage.cssArticle.description": "تعرف على كيفية تساعد خصائص CSS المنطقية في إنشاء واجهات تكيفية للغات واتجاهات كتابة مختلفة - دون تعقيد الكود أو تكرار الأنماط.",
  "homePage.articles.title": "مقالات",
  "homePage.articles.description": "إجمالي {count, plural, zero {لا مقالات} one {# مقالة} two {# مقالتين} few {# مقالات} many {# مقالة} other {# مقالة}}",
  "homePage.article.read": "اقرأ"
}