{
  "layout.footer.copyright": "© {yearStart}-{yearEnd}, ООО «<link>{brand}</link>». Все права защищены",
  "homePage.hero.title": "Соединяем цифровые миры на всех языках",
  "homePage.hero.conference": "Конференция I&L-{year}",
  "homePage.hero.location": "Москва, Россия",
  "homePage.hero.price": "{price} билет",
  "homePage.hero.register": "Зарегистрироваться",
  "homePage.regionArticle.title": "Актуально для вашего региона",
  "homePage.ruArticle.title": "Как адаптировать веб-приложение под российских пользователей: нюансы локализации",
  "homePage.ruArticle.description": "Изучаем предпочтения русскоязычных пользователей, числовые и валютные форматы, перевод интерфейса и юридические аспекты (например, закон о персональных данных)",
  "homePage.byArticle.title": "Двухъязычный интерфейс: как учесть русский и белорусский языки в одном продукте",
  "homePage.byArticle.description": "Рассматриваем подходы к реализации двуязычного интерфейса, стандарты перевода и культурные отличия. Особое внимание — контенту на белорусском языке",
  "homePage.kzArticle.title": "Русский и казахский: эффективная локализация для Казахстана",
  "homePage.kzArticle.description": "Разбираем сценарии, когда приложение должно быть доступно сразу на двух языках, и особенности казахской локали (в т.ч. поддержка латиницы и кириллицы, особенности форматов дат)",
  "homePage.arArticle.title": "Локализация для арабоязычного мира: RTL, форматы и культурные коды",
  "homePage.arArticle.description": "От адаптации интерфейса под направление письма справа налево до выбора правильных формулировок — ключевые аспекты локализации для стран Ближнего Востока и Северной Африки",
  "homePage.enArticle.title": "Проектирование для глобальной аудитории: английский как универсальный язык",
  "homePage.enArticle.description": "Почему английский часто используется как язык по умолчанию в международных приложениях и как писать интерфейсные тексты, которые будут понятны, культурно нейтральны и удобны для последующей локализации",
  "homePage.rtlArticle.title": "Какие иконки нужно разворачивать для RTL, а какие — нет?",
  "homePage.rtlArticle.description": "Не все иконки требуют зеркального отражения при переключении на RTL-языки. Разбираемся, какие иконки зависят от направления текста, а какие — универсальны",
  "homePage.cssArticle.title": "Логические CSS-свойства в интерфейсах с поддержкой i18n",
  "homePage.cssArticle.description": "Узнайте, как логические CSS-свойства помогают создавать адаптивные интерфейсы для разных языков и направлений письма — без усложнения кода и дублирования стилей.",
  "homePage.articles.title": "Статьи",
  "homePage.articles.description": "Всего {count, plural, one {# статья} few {# статьи} many {# статей} other {# статьи}}",
  "homePage.article.read": "Читать"
}